{"name":"Murathan Yildirim","headerTaglineOne":"Hi 👋, I'm Murathan Yildirim -","headerTaglineTwo":"curious developer and designer","headerTaglineThree":" based in the best city of ","headerTaglineFour":"the world, Istanbul, Turkey.","showBlog":false,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/murathany7"},{"id":"5","title":"Email","link":"mailto:murathanprogram@gmail.com"}],"projects":[{"id":"1","title":"Dostuma Sor","description":"Mobile App","imageSrc":"https://i.imgur.com/2K02X3n.jpg","url":"https://play.google.com/store/apps/details?id=com.muratyildirim.dostumasorchat"},{"id":"2","title":"Doge Fun Bet","description":"Blockchain and Web Design & Development","imageSrc":"https://www.statestreet.com/web/insights/articles/images/StateStreet_IN_CryptoDigitalTrans_Abstract_Hero_V2.jpg","url":"https://relaxed-taiyaki-fd23b7.netlify.app/"},{"id":"3","title":"CyBank","description":"Web Design","imageSrc":"https://img.freepik.com/free-vector/banking-app-interface-screens_23-2148604478.jpg?w=2000","url":"http://www.github.com/murathany7/CyBank"},{"id":"4","title":"CyStocks","description":"Stock Market App","imageSrc":"https://miro.medium.com/max/640/0*A3_Cyq8cpHVMce9g","url":"http://www.github.com/murathany7/cystox"},{"id":"5","title":"CryptoLand","description":"Crypto DApplication Development","imageSrc":"https://bitpay.com/blog/content/images/2021/12/Buying-Real-Estate-with-Crypto.png","url":"https://github.com/murathany7/CryptoLand"},{"id":"10dde87d-cc32-424a-bc93-39afeb572d2e","title":"Assembly Code","description":"Group Project","imageSrc":"https://www.origin.bank/userfiles/blog/OGB-MobileApp-Blog-01.png","url":"https://github.com/murathany7/coms321/tree/master/project2 "},{"id":"cba45480-aff4-4bcb-87a3-660e6be41497","title":"Scraper","description":"Custom Data Scraper","imageSrc":"https://miro.medium.com/max/1280/1*w7LY0l8xs3T2NG42N03iKw.jpeg","url":"http://www.github.com/murathany7/scraper"}],"services":[{"id":"1","title":"Custom Application Development","description":"I help with the creation and development of online or offline applications, with a particular focus on aesthetics and user experience."},{"id":"3","title":"Web Application Development Design","description":"I build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"5f84a6f1-8f12-4f7c-8b55-00a648e9091e","title":"Blockchain Development","description":"Leveraging my extensive knowledge in blockchain technology, I offer cryptocurrency programming services to integrate secure and efficient crypto solutions into your digital assets."},{"id":"9b07a812-e143-4841-b3af-c91a57a7219b","title":"AI Engineering","description":"Using advanced machine learning techniques, I deliver AI engineering services to solve complex problems, enhance your business operations and drive innovation in your products or platforms."}],"aboutpara":"With a decade-long journey in software engineering, I've honed my skills in mobile and web application development, creating captivating digital experiences that drive business growth. My proficiency extends into the realm of AI engineering, where I apply advanced machine learning algorithms to solve complex problems. Alongside, my extensive knowledge and practical programming experience in the world of cryptocurrencies, driven by my passion for blockchain technology, further strengthens my ability to contribute significantly to innovative projects. This blend of knowledge, skills, and passion underscores my commitment to collective success and technological innovation.","resume":{"tagline":"👋  I'm a Software and AI Engineer,","description":"Versatile software engineer specializing in AI, with expertise in web and mobile app development, as well as data analysis and processing. Passionate about leveraging emerging technologies to craft innovative solutions. Ready to contribute dynamic insights to AI-driven projects.","experiences":[{"id":"1","dates":"March 2021- August 2021","type":"Full Time","position":"Full-Stack Developer intern at thehomepainter","bullets":"Worked both as part of a team and individually to develop a utility for testing production web services, did development on production level code working on products such as NodeJS  MongoDB queries and Angular, Gained experience with both front-end and back-end development fixing bugs and implementing new features, I was responsible for migrating existing service configurations to an updated format allowing for more scalability"},{"id":"77548609-5080-4d82-a06d-c4625c7dde49","dates":"June 2023- August 2023","type":"Full Time","position":"AI Engineer intern at Huawei Türkiye","bullets":"Contributed to the development of Huawei's recommender systems product tailored for various businesses and leveraging the PyTorch DeepCTR framework, Involved in the full-stack development as well as crafting both front-end and back-end solutions and ensuring seamless data integration for clients,Collaborated closely with cross-functional teams to optimize recommendation algorithms and enhance overall system performance, Worked with clients to customize and deploy AI-driven recommendations resulting in enhanced user experiences and increased engagement"},{"id":"c84e48db-1595-4298-a327-e8c19c627241","dates":"January 2022  – Current","type":"Remote","position":"Web and Mobile Developer at Mutamin","bullets":"Spearheaded the development and enhancement of website and mobile applications for an e-commerce business, Leveraged Flutter framework for mobile app development and React framework for web application development, Utilized data analytics to provide insights for product improvement, •\tImplemented iterative improvements to both website and mobile applications ensuring alignment with evolving business needs and technological advancements."}],"education":{"universityName":"Iowa State University","universityDate":"2020-2023","universityPara":"I started with learning Java, advanced to Python and web development since they are inside my interests. Took courses about Data Structure and Algorithms, Databases, various team project classes. However I moved to Turkey and I am currently a senior in Istanbul Okan University.."},"languages":["Javascript","HTML5","CSS","Python","Java","C/C++,C#"],"frameworks":["React","Typescript","NodeJs","Flutter"],"others":["Figma","AWS","Jira"]}}